<?php
use PhpOffice\PhpSpreadsheet\Helper\Html;
use PhpOffice\PhpSpreadsheet\Writer;
use PhpOffice\PhpSpreadsheet\Style\Fill;
use PhpOffice\PhpSpreadsheet\Style\Border;
use PhpOffice\PhpSpreadsheet\Style\Color;

define("START_POSITION_TABLE", 2);
define("CHAR_HEIGHT", 36);

$arrColorsForChar = [
    "FFBE0B",
    "FB5607",
    "FF006E",
    "8338EC",
    "3A86FF",
    "8ECAE6",
    "219EBC",
    "023047",
    "FFB703",
    "FB8500",
    "F94144",
    "F3722C",
    "F8961E",
    "F9844A",
    "F9C74F",
    "90BE6D",
    "43AA8B",
    "4D908E",
    "577590",
    "277DA1"
];

$overStyleForTable = [
    'BORDER'=>[                         // CТИЛЬ ОФОРМЛЕНИЯ ГРАНИЦ ТАБЛИЦЫ
        'borders' => [
            'allBorders' => [
                'borderStyle' => Border::BORDER_THIN //fine border
            ]
        ]
    ],
    "zag_style" => [                    // CТИЛЬ ОФОРМЛЕНИЯ ЗАГОЛОВКОВ ТАБЛИЦЫ
        'font'=>[
            'bold' => true,
            'color' => ['rgb' => '000000'],
            'size' => 14,
            'name' => 'Arial'
        ],
    ],
    "header_style" => [                 // CТИЛЬ ОФОРМЛЕНИЯ ШАПКИ ТАБЛИЦЫ
        'font'=>[
            'bold' => true,
            'color' => ['rgb' => '000000'],
            'size' => 10,
            'name' => 'Arial'
        ],
        'fill' => [
            'fillType' => Fill::FILL_SOLID,
            'startColor' => ['rgb' => 'EEF0F4']
        ]
    ],
    "row_color"=>[
        "start"=>[
            'fill' => array(
                'fillType' => Fill::FILL_SOLID,
                'startColor' => array('argb' => 'FF4F81BD')
            )
        ],
        "stop"=>[
            'fill' => array(
                'fillType' => Fill::FILL_SOLID,
                'startColor' => array('argb' => 'FF4F81BD')
            )
        ],
    ]
];


/* Выбор настроек отчёта в зависимости от названия */
function selectXlsxSchem($N){
    $arrN = [
        'пб_ОтчетПоПоступлению'=>[
            'schema'=>'Report_1106_2',
            'arrColumnCalc'=>['Количество'=>['top'], 'ЦенаМинимум'=>['min'], 'ЦенаМаксимум'=>['max'], 'ЦенаСредняя'=>['mid']],
            'arrColumnSort' => ['Предприятие','Товар'],
            'arrStyle'=>[
                "header_text" => "Отчет по поступлению товаров",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','',"Итого","","",""],
                ["","","Количество","Минимальная цена","Максимальна цена","Средняя цена"]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]],
                'char'=>[
                    'type'=>'charPie',
                    'variant'=>'all'
                ]
            ]

        ],
        'юк_РитуальныеУслугиПоОкругам'=>[
            'schema'=>'Report_1248_1',
            'arrColumnCalc'=>['КоличествоГСС'=>['top','itogo'], 'КоличествоМагазинНадмогильныхСооружений'=>['top','itogo'], 'КоличествоМагазинРитуальнойПродукции'=>['top','itogo'],
                'КоличествоМастерскаяПоИзготовлениюНадмогильныхСооружений'=>['top','itogo'], 'КоличествоПунктПприемаЗаказовНаОрганизациюПохорон'=>['top','itogo'],
                'КоличествоПунктПриемаЗаказовНаУстановкуНадмогильныхСооружений'=>['top','itogo'], 'КоличествоВсего'=>['top','itogo'], 'ДатаВерсии'=>['data']],
            'arrColumnSort' => ['Округ','Район'],
            'arrStyle'=>[
                "header_text" => "Общий отчет по объектам ритуального назначения",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ','Район',"","","","","","","",""],
                ["","","Количество ГСС","Количество магазинов надмогильных сооружений", "Количество магазинов ритуальной продукции",
                    "Количество мастерских по изготовлению надмогильных сооружений", "Количество пунктов приема заказов на организацию похорон",
                    "Количество пунктов приема заказов на установку надмогильных сооружений","Всего","Дата последнего редактирования"]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]],
                'recurs_similar'=>'Y',
//                'char'=>[
//                    'type'=>'charPie',
//                    'variant'=>'all'
//                ]
            ]

        ],
        'хс_ОтчетПоИзмененнымОбъектамЗаПериод'=>[
            'schema'=>'Report_1178_1',
            'arrColumnCalc'=>['ОбъектАдресАдресногоРеестра'=>['data'],'ОбъектСоздан'=>['top','itogo'], 'ОбъектИзменен'=>['top','itogo'],
                'ОбъектЗакрыт'=>['top','itogo']],
            'arrColumnSort' => ['ВидОбъекта','Округ', 'Район', 'Объект'],
            'arrStyle'=>[
                "header_text" => "Отчет по измененным объектам за период",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Вид Объекта','Округ',"Район","Объект","","","","",],
                ["","","","", "Адрес", "Новых", "Измененных", "Закрытых"]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'E','row'=>0]],
                'recurs_similar'=>'Y',
//                'char'=>[
//                    'type'=>'charPie',
//                    'variant'=>'all'
//                ]
            ]

        ],

        'дт_ОбеспеченностьЖителей'=>[
            'schema'=>'Report_1026_1',
            'arrColumnCalc'=>['обеспеченность'=>['top']],
            'arrColumnSort' => ['Территория','Округ', 'Период'],
            'arrStyle'=>[
                "header_text" => "Отчет по измененным объектам за период",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Вид Объекта','Округ',"Район","Объект","","","","",],
                ["","","","", "Адрес", "Новых", "Измененных", "Закрытых"]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'E','row'=>0]],
                'recurs_similar'=>'Y',
//                'char'=>[
//                    'type'=>'charPie',
//                    'variant'=>'all'
//                ]
            ]

        ],

        'юк_ОтчетОбследованиеСтационарныхОбъектов'=>[
            'schema'=>'Report_1277_1',
            'arrColumnCalc'=>['ИспользованиеСИЗ'=>['top','itogo'], 'СоблюдениеТребованийДист'=>['top','itogo'], 'ЗапретНаРаботу'=>['top','itogo'], 'Количество'=>['top','itogo']],
            'arrColumnSort' => ['Округ','Район'],
            'arrStyle'=>[
                "header_text" => "Отчёт 'Обследование стационарных объектов в разрезе округов/районов'",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ','Район',"","","",""],
                ["","","Использование средств индивидуальной защиты","Соблюдение требований по организации социального дистанцирования",
                    "Запрет на работу","Количество"]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]],
                'recurs_similar'=>'Y',
                'char'=>[
                    'type'=>'charPie',
                    'variant'=>'all'
                ]
            ]

        ],
        'кс_ОткрытиеНовыхПредприятийРозничнойТорговли'=>[
            'schema'=>'Report_1068_1',
            'arrColumnCalc'=>['ДатаОткрытия'=>['data'], 'ДатаЗакрытия'=>['data'], 'СрокФункционирования'=>['data'], 'ОбщаяПлощадь'=>['top','itogo'], 'ТорговаяПлощадь'=>['top','itogo']],
            'arrColumnSort' => ['Округ','Район','ОбъектРозничнойТорговли'],
            'arrStyle'=>[
                "header_text" => "Открытые/закрытые объекты розничной торговли",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ','Район',"","","","","","", ""],
                ["","","Наименование объекта","Дата открытия", "Дата закрытия", "Срок функционирования (в годах, месяцах)",
                    "Общая площадь","Торговая площадь", "Количество СТО"]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                'recurs_similar'=>'Y',
                'char'=>[
                    'type'=>'charPie',
                    'variant'=>'all'
                ]
            ]

        ],
        'пб_АналитическийОтчетОСравненииОбъемовТоваровЗаНесколькоПериодов'=>[
            'schema'=>'Report_1097_1',
            'arrColumnCalc'=>['Количество'=>['top','itogo'], 'Количество2'=>['top','itogo']],
            'arrColumnSort' => ['ТоварРодитель','Товар','Предприятие'],
            'arrStyle'=>[
                "header_text" => "Аналитический отчет о сравнении объемов поступления (реализации) товаров за несколько периодов",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Товар','Предприятие',"","","",""],
                ["","","","1-й Период", "2-й Период", "Сравнение 2-й период к 1-му периоду, %",]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
//                'recurs_similar'=>'Y',
                'char'=>[
                    'type'=>'charPie',
                    'variant'=>'all'
                ]
            ]

        ],
        'юк_СоблюдениеПредписанийРПН.Основной1'=>[
            'schema'=>'Report_1271_1',
            'arrColumnCalc'=>['КоличествоПредприятийШт'=>['top','itogo'],'БылоЗакрыто' => ['top','itogo'],'ВозобновилиДеятельность' => ['top','itogo'],'ПредписаниеРПННаправлено' => ['top','itogo'],'МониторингПроведен' => ['top','itogo'],
                'ФИООтветственного' => ['top','itogo'],'ДолжностьОтветственного' => ['top','itogo'],'ТелефонОтветственного' => ['top','itogo'],'ПочтаОтветственного' => ['top','itogo'],'ПриказНаОтветственного' => ['top','itogo'],'СоциальнаяРазметкаСнаружи' => ['top','itogo'],
                'СоциальнаяРазметкаВнутри' => ['top','itogo'],'ИнформационныеТабличкиПриВходе' => ['top','itogo'],'АнтисептикиДляРук' => ['top','itogo'],'ЗвуковаяТрансляция' => ['top','itogo'],'Видеоролики' => ['top','itogo'],
                'ОбъявлениеОбОбязательномИспользованииСИЗ' => ['top','itogo'],'БактерицидныеОблучателиРециркуляторы' => ['top','itogo'],'ИспользованиеРаботникамиСИЗ' => ['top','itogo'],],
            'arrColumnSort' => ['СсылкаОкругОтчет','СсылкаРайон', 'Ссылка',],
            'arrStyle'=>[
                "header_text" => "Соблюдение предписаний РПН (бытовые услуги)",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ',"Район","","","","","","", "","","","","","", "","","","","","","",""],
                ["","","Объект","Количество предприятий, шт","Было закрыто","Возобновили деятельность","Предписание РПН направлено","Мониторинг проведен (предписание РПН)",
                    "ФИО ответственного","Должность ответственного","Телефон ответственного","Почта ответственного","Приказ на ответственного","Социальная разметка снаружи",
                    "Социальная разметка внутри","Информационные таблички при входе","Антисептики для рук при входе","Звуковая трансляция","Видеоролики",
                    "Объявление об использовании СИЗ","Бактерицидные облучатели-рециркуляторы","Использование работниками СИЗ"],
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                'recurs_similar'=>'Y',
            ]

        ],
        'пб_АналитическийОтчетОПоступленииТоваров_.В разрезе субъектов'=>[
            'schema'=>'Report_9902_1',
            'arrColumnCalc'=>['Количество'=>['top','percent','itogo']],
            'arrColumnSort' => ['Регион','Товар'],
            'arrStyle'=>[
                "header_text" => "Аналитический отчет о поступлении продовольствия из субъектов РФ в разрезе товаров",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],

            ],
            "header_line" => [
                ['Регион',"","Итого",""],
                ["Товар","","Количество","Процент"]
            ],
            'rula'=>[
                'exc'=>['col'=>"Страна",'val'=>"РОССИЯ"],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]]
            ]
        ],
        'хс_ИнформацияОТорговыхКомплексах.ОсновнойExcel'=>[
            'schema'=>'Report_1144_2',
            'arrColumnCalc'=>[
                'НомерПоПорядку' => '',
                'КодСИОПР' => '',
                'ГрупповойОбъект' => '',
                'Округ' => '',
                'Район' => '',
                'ГрупповойОбъектАдрес' => '',
                'ГрупповойОбъектДатаОткрытия' => '',
                'ОбщаяПлощадьВсего' => '',
                'ОбщаяПлощадьЗанято' => '',
                'ОбщаяПлощадьСвободно' => '',
                'ТорговаяПлощадьВсего' => '',
                'ТорговаяПлощадьЗанято' => '',
                'ТорговаяПлощадьСвободно' => '',
                'КоличествоТорговыхМестВсего' => '',
                'КоличествоТорговыхМестЗанято' => '',
                'КоличествоТорговыхМестСвободно' => '',
                'ВременнаяПриостановка' => '',
                'ТорговыеОбъектыПриостановка' => '',
                'ОбъектыОбщественногоПитанияПриостановка' => '',
                'ПриостановкаОбщаяПлощадьВсего' => '',
                'ПриостановкаОбщаяПлощадьТорговая' => '',
                'ПриостановкаОбщаяПлощадьОбщественноеПитание' => '',
                'ПриостановкаТорговаяПлощадьВсего' => '',
                'ПриостановкаТорговаяПлощадьТорговая' => '',
                'ПосещаемостьЕженедельная' => '',
                'ПосещаемостьЕжемесячная' => '',
                'АрендуемаяПлощадьВсего' => '',
                'АрендуемаяПлощадьЗанято' => '',
                'АрендуемаяПлощадьСвободно' => '',
                'ТорговыеОбъектыЧислоРаботников' => '',
                'ТорговыеОбъектыЧислоРаботниковБудни' => '',
                'ТорговыеОбъектыЧислоРаботниковВыхи' => '',
                'ОбщественноеПитаниеЧислоРаботников' => '',
                'ОбщественноеПитаниеЧислоРаботниковБудни' => '',
                'ОбщественноеПитаниеЧислоРаботниковВыхи' => '',
                'БытовоеОбслуживаниеЧислоРаботников' => '',
                'БытовоеОбслуживаниеЧислоРаботниковБудни' => '',
                'БытовоеОбслуживаниеЧислоРаботниковВыхи' => '',
                'ПрочиеЧислоРаботников' => '',
                'ПрочиеЧислоРаботниковБудни' => '',
                'ПрочиеЧислоРаботниковВыхи' => '',
                'СредняяЧисленностьРаботниковУК' => '',
                'ЧислоРаботниковВсего' => '',
                'ЧислоРаботниковВсегоБудни' => '',
                'ЧислоРаботниковВсегоВыхи' => '',
                'ТорговыеОбъектыЗанято' => '',
                'ТорговыеОбъектыКоличество' => '',
                'ОбъектыОбщественногоПитанияЗанято' => '',
                'ОбъектыОбщественногоПитанияКоличество' => '',
                'ОбъектыБытовогоОбслуживанияЗанято' => '',
                'ОбъектыБытовогоОбслуживанияКоличество' => '',
                'ИнтернетТорговляЗанято' => '',
                'ИнтернетТорговляКоличество' => '',
                'КинотеатрЗанято' => '',
                'КинотеатрКоличество' => '',
                'ЗоныРазвлеченийЗанято' => '',
                'ЗоныРазвлеченийКоличество' => '',
                'АвтомойкиЗанято' => '',
                'АвтомойкиКоличество' => '',
                'ШиномонтажиЗанято' => '',
                'ШиномонтажиКоличество' => '',
                'ПрочиеОбъектыЗанято' => '',
                'ПрочиеОбъектыКоличество' => '',
                'ПарковкиВнутриЗданий' => '',
                'СкладскиеПомещения' => '',
                'ОбщественнаяЗонаОбъектыИнфраструктуры' => ''
                ],
            'arrColumnSort' => [''],
            'arrStyle'=>[
                "header_text" => "Информация о торговых комплексах Excel",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['',
                    '№ п/п',
                    'Код СИОПР',
                    'Наименование ТЦ',
                    'Округ',
                    'Район',
                    'Адрес',
                    'Дата открытия',
                    'Всего',
                    'Занято по состоянию на',
                    'Свободно по состоянию на',
                    'Торговых площадей всего',
                    'Занято по состоянию на',
                    'Свободно по состоянию на',
                    'Количество торговых мест всего',
                    'Занято по состоянию на',
                    'Свободно по состоянию на',
                    'Всего приостановлено ед.на',
                    'приостановлено торговых объектов',
                    'Приостановлено объектов общественного питания',
                    'Всего приостановлено, общая площадь на ',
                    'приостановлено торговых объектов, общая площадь',
                    'Приостановлено объектов общественного питания, общая площадь',
                    'Всего приостановлено, торговая площадь на',
                    'приостановлено торговых объектов, торговая площадь',
                    'Еженедельная (чел.)',
                    'Ежемесячная (чел.)',
                    'Всего',
                    'В будние дни',
                    'В выходные дни',
                    'Всего',
                    'В будние дни',
                    'В выходные дни',
                    'Всего',
                    'В будние дни',
                    'В выходные дни',
                    'Всего',
                    'В будние дни',
                    'В выходные дни',
                    'Число работников управляющей','','','','','','','','','','','','','','','','','','','','']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
                "forPie"=>[
                    'values'=>'gist',
                ]
            ]
        ],
        'пб_АналитическийОтчетОПоступленииТоваров_.В разрезе стран - поставщиков'=>[
            'schema'=>'Report_9902_4',
            'arrColumnCalc'=>['Количество'=>['top','percent','itogo']],
            'arrColumnSort' => ['Товар','Страна'],
            'arrStyle'=>[
                "header_text" => "Аналитический отчет о поступлении товаров в разрезе стран - поставщиков",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ["Товар","","Итого",""],
                ["Страна","","Количество","Процент"],
            ],
            'rula'=>[
                'exc'=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]]]
        ],
        'пб_АналитическийОтчетОПоступленииТоваров_.В разрезе субъектов - поставщиков'=>[
            'schema'=>'Report_9902_2',
            'arrColumnCalc'=>['Количество'=>['top','percent','itogo']],
            'arrColumnSort' => ['Товар','Регион'],
            'arrStyle'=>[
                "header_text" => "Аналитический отчет о поступлении товаров в разрезе субъектов РФ-поставщиков",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 10,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Товар',"","Итого",""],
                ["Регион","","Количество","Процент"]
            ],
            'rula'=>[
                'exc'=>['col'=>"Страна",'val'=>"РОССИЯ"],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]]]
        ],
        'пб_АналитическийОтчетОПоступленииТоваров.В разрезе товаров'=>[
            'schema'=>'Report_9902_3',
            'arrColumnCalc'=>['Количество'=>['top','percent','itogo']],
            'arrColumnSort' => ['Страна','Товар'],
            'arrStyle'=>[
                "header_text" => "Аналитический отчет о поступлении продовольствия из стран в разрезе товаров",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Страна','',"Итого",""],
                ["Товар","","Количество","Процент"]
            ],
            'rula'=>[
                'exc'=>[""],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]]]
        ],
        'пб_АналитическийОтчетОПоступленииПродовольствияПоИмпортуВРазрезеГруппТоваров'=>[
            'schema'=>'Report_1095_1',
            'arrColumnCalc'=>['КоличествоПриход'=>['top','percent','itogo']],
            'arrColumnSort' => ['Группа','Товар','Предприятие'],
            'arrStyle'=>[
                "header_text" => "Аналитический отчет о поступлении продовольствия по импорту в разрезе групп товаров (товаров)",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Группа товаров','',"","",""],
                ['Товар','',"","Итого",""],
                ["Поставщик","","","Количество","Процент"]
            ],
            'rula'=>[
                'exc'=>[""],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                "forPie"=>[
                    'values'=>'all',
                ]
            ]
        ],
        'кс_ИнформацияОСогласованииПаспортовБезопасностиТорговыхОбъектов'=>[
            'schema'=>'Report_1263_1',
            'arrColumnCalc'=>["колКатегория123" => ['top','itogo'],
                "СогласованоПБ" => ['top','itogo'],
                "НеСогласованоПБ" => ['top','itogo'],
                "ВРазработке" => ['top','itogo'],
                "НаСогласованииВМЧС" => ['top','itogo'],
                "НаСогласованииВФСБ" => ['top','itogo'],
                "НаСогласованииВРосгвардии" => ['top','itogo'],
                "ИтогоНаСогласовании" => ['top','itogo'],
                "НеРазработан" => ['top','itogo'],
            ],
            'arrColumnSort' => ['Округ','Район'],
            'arrStyle'=>[
                "header_text" => "Согласование паспортов безопасности торговых объектов",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','','',"","","","На согласовании","","","",""],
                ['','','Присвоена I-III категория',"Согласование ПБ","Не согласован ПБ","В разработке","МЧС","ФСБ","Росгвардия","Итого на согласовании",'Не разрабатывался'],

            ],
            'rula'=>[
                'exc'=>[""],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]],
                "forPie"=>[
                    '',
                ],
//                "view" =>'list'
            ]
        ],'аз_ОтчетПоИзмененнымСубъектамУчетаЗаПериод'=>[
            'schema'=>'Report_1293_1',
            'arrColumnCalc'=>[
                "Счетчик" => ['top','itogo'],
                "кс_ВключеноВГородскойПеречень" => ['top','itogo'],
                "ВсеСТО" => ['top','itogo','max'],
                "СвязанныеСТО" => ['top','itogo','max'],
                "ЗакрытоТОНеКатегорированные" => ['top','itogo'],
                "ЗакрытоТОБезКатегории" => ['top','itogo'],
                "колКатегория0" => ['top','itogo'],
                "колКатегория1" => ['top','itogo'],
                "колПаспорт1" => ['top','itogo'],
                "колКатегория2" => ['top','itogo'],
                "колПаспорт2" => ['top','itogo'],
                "колКатегория3" => ['top','itogo'],
                "колПаспорт3" => ['top','itogo'],
                "ПрисвоенаКатегория" => ['top','itogo'],
                "РазработаноПБ" => ['top','itogo'],
                "Категорировано" => ['top','itogo'],


                "НеКатегорировано" => ['top','itogo'],
            ],
//            'arrColumnSort' => ['Округ','Район','СТОСсылка'],
            'arrColumnSort' => ['Округ','Район','СвязанныеСТО'],
            'arrStyle'=>[
                "header_text" => "Отчет по измененным субъектам категорирования за период",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','','','',"","","","","","","Присвоена категория/утверждено паспортом безопасности","","","","","","","",""],
                ['','','','',"","","","","","","Первая","","Вторая","","Третья","","Всего","",""],
                ['','','','Всего измененных субъектов за период',"Включено в перечень","Всего СТО", "Связанных СТО","Закрытые, не категорированные",
                    "Закрытые, ранее категорированные","Объекты 'без категории' (0)",
                    "Всего","Паспорт","Всего","Паспорт","Всего","Паспорт",
                    "Присвоена Категория","Разработано ПБ","Категорировано"],

            ],
            'rula'=>[
                'exc'=>[""],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                "forPie"=>[
                    '',
                ]
            ]
        ],'кс_РезультатыКатегорированияИПаспортизацииТорговыхОбъектовПоППРФ1273.Основной'=>[
            'schema'=>'Report_1264_1',
            'arrColumnCalc'=>[
                "кс_ВключеноВГородскойПеречень" => ['top','itogo'],
                "ВсеСТО" => ['top','itogo'],
                "СвязанныеСТО" => ['top','itogo'],
                "ЗакрытоТОНеКатегорированные" => ['top','itogo'],
                "ЗакрытоТОБезКатегории" => ['top','itogo'],
                "колКатегория0" => ['top','itogo'],
                "колКатегория1" => ['top','itogo'],
                "колПаспорт1" => ['top','itogo'],
                "колКатегория2" => ['top','itogo'],
                "колПаспорт2" => ['top','itogo'],
                "колКатегория3" => ['top','itogo'],
                "колПаспорт3" => ['top','itogo'],
                "ПрисвоенаКатегория" => ['top','itogo'],
                "РазработаноПБ" => ['top','itogo'],
                "Категорировано" => ['top','itogo'],

            ],
            'arrColumnSort' => ['Район','СТОСсылка'],
            'arrStyle'=>[
                "header_text" => "Результаты категорирования и паспортизации торговых объектов по ПП РФ № 1273",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','','','',"","","","Присвоена категория/утверждено паспортом безопасности","","","","","","","","","","",""],
                ['','','','',"","","","На согласовании","","","","","","","","","","",""],
                ['','','','Всего измененных субъектов за период',"Включено в перечень","Закрытые, не категорированные",
                    "Закрытые, ранее категорированные","Объекты 'без категории' (0)",
                    "Всего","Паспорт","Всего","Паспорт","Всего","Паспорт",
                    "Присвоена Категория","Разработано ПБ","Категорировано","Всего СТО", "Связанных СТО"],

            ],
            'rula'=>[
                'exc'=>[""],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]],
                "forPie"=>[
                    '',
                ]
            ]
        ],
        'пб_ОтчетОбИзмененииОстатков'=>[
            'schema'=>'Report_1099_1',
            'arrColumnCalc'=>['G'=>['line_sub_calc']],
            'arrColumnSort' => ['B'=>'SORT_DESC','C'=>'SORT_ASC','E'=>'SORT_ASC'],
            'arrStyle'=>[
                "header_text" => "Отчет об изменении остатков",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Товар',"","","10.10.10","","","10.10.10","","","10.10.10","",""],
                ["","Предприятие","Остаток","Остатки","Изменение","%","Остатки","Изменение","%","Остатки","Изменение","%"]
            ],
            'rula'=>[
                'exc'=>[""],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'B','row'=>0]],
                "forPie"=>[
                    'values'=>'no',
                ]
            ]
        ],
        'дт_АктуальныеДоговоры'=>[
            'schema'=>'Report_1019_1',
            'arrColumnCalc'=>['Договор'=>'','НО'=>'','Период'=>''],
            'arrColumnSort' => [],
            'arrStyle'=>[
                "header_text" => "Актуальные договоры",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Договор','НО','Период'],
                ["","",""]
            ],
            'rula'=>[
                'exc'=>[""],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
                "forPie"=>[
                    'values'=>'no',
                ]
            ]
        ],
        'аз_ПоказателиРеализацииГенеральногоПлана.Форма2'=>[
            'schema'=>'Report_1294_1',
            'arrColumnCalc'=>['НомерПоПорядку'=>'','ВидОбъекта'=>'','Округ'=>'','Unom'=>'','УлицаДом'=>'','Код'=>'','ВидУслугНаселению'=>'','ТипЗдания'=>'','Единицы'=>'','ПроектнаяЕмкостьОбъекта'=>'','СТООбщаяПлощадьРасчетная'=>'','ТерриторияОбъекта'=>'','ГодВводаОбъекта'=>'','ПринадлежностьКГрупповомуОбъекту'=>'','КоординатаХ'=>'','КоординатаУ'=>'','ЧислоРаботников'=>''],
            'arrColumnSort' => ['ВидТорговли'],
            'arrStyle'=>[
                "header_text" => "Форма №2. Сведения о существующих объектах по состоянию на",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','№ п/п','Наименование объекта','Округ','Уникальный номер адреса (UNOM БТИ)', 'Адрес','Код объекта (СИОПР)','Вид услуг населению (для объектов розничной торговли)', 'Вид размещения (отдельно стоящее, встроенное, пристроенное помещение, занимаемое объектом)','Вид объекта','Единицы измерения (кв.м. торг. пл. / посадочных мест / рабочих мест)',' Проектная емкость объекта в единицах измерения','Общая площадь объекта, кв. м','Территория, кв. м','Год ввода','В составе торгового комплекса','Координаты объекта долгота WGS-84','Координаты объекта широьа WGS-84','Количество работающих']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
                "forPie"=>[
                    'values'=>'gist',
                ]
            ]
        ],'аз_ПоказателиРеализацииГенеральногоПлана.Форма1'=>[
            'schema'=>'Report_1294_2',
            'arrColumnCalc'=>['НомерПоПорядку'=>'','ВидОбъекта'=>'','Округ'=>'','Unom'=>'','УлицаДом'=>'','Код'=>'','ВидУслугНаселению'=>'','ТипЗдания'=>'','Единицы'=>'','ПроектнаяЕмкостьОбъекта'=>'','СТООбщаяПлощадьРасчетная'=>'','ТерриторияОбъекта'=>'','ГодВводаОбъекта'=>'','ПринадлежностьКГрупповомуОбъекту'=>'','КоординатаХ'=>'','КоординатаУ'=>'','ЧислоРаботников'=>''],
            'arrColumnSort' => ['ОкругОкругНаименованиеПолное','Район'],
            'arrStyle'=>[
                "header_text" => "Генплан Форма №1",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','№ п/п','Наименование объекта','Округ','Уникальный номер адреса (UNOM БТИ)', 'Адрес','Код объекта (СИОПР)','Вид услуг населению (для объектов розничной торговли)', 'Вид размещения (отдельно стоящее, встроенное, пристроенное помещение, занимаемое объектом)','Вид объекта','Единицы измерения (кв.м. торг. пл. / посадочных мест / рабочих мест)',' Проектная емкость объекта в единицах измерения','Общая площадь объекта, кв. м','Территория, кв. м','Год ввода','В составе торгового комплекса','Координаты объекта долгота WGS-84','Координаты объекта широьа WGS-84','Количество работающих']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
                "forPie"=>[
                    'values'=>'gist',
                ]
            ]
        ],
        'хс_НекорректноПривязанныеСетевыеОбъекты.СтационарныеТорговыеОбъекты'=>[
            'schema'=>'Report_1170_1',
            'arrColumnCalc'=>['Код'=>["sim"],'Количество'=>['topSum'],'НаименованиеОбъекта'=>["sim"],'НаименованиеСети'=>["sim"]],
            'arrColumnSort' => ['Округ','Район'],
            'arrStyle'=>[
                "header_text" => "Некорректно привязаные сетевые объекты (СТО)",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','№ п/п','Наименование объекта','Округ','Уникальный номер адреса (UNOM БТИ)', 'Адрес','Код объекта (СИОПР)','Вид услуг населению (для объектов розничной торговли)', 'Вид размещения (отдельно стоящее, встроенное, пристроенное помещение, занимаемое объектом)','Вид объекта','Единицы измерения (кв.м. торг. пл. / посадочных мест / рабочих мест)',' Проектная емкость объекта в единицах измерения','Общая площадь объекта, кв. м','Территория, кв. м','Год ввода','В составе торгового комплекса','Координаты объекта долгота WGS-84','Координаты объекта широьа WGS-84','Количество работающих']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
                "forPie"=>[
                    'values'=>'gist',
                ]
            ]
        ],
        'хс_ИнформацияОТорговыхКомплексах.Основной'=>[
            
            'schema'=>'Report_1144_1',
            'arrColumnCalc'=>['НомерПоПорядку'=>'','КодСИОПР'=>'','ГрупповойОбъект'=>'','Округ'=>'','Район'=>'','ГрупповойОбъектАдрес'=>'','ГрупповойОбъектДатаОткрытия'=>'','ОбщаяПлощадьВсего'=>'','ОбщаяПлощадьЗанято'=>'','ОбщаяПлощадьСвободно'=>'','ТорговаяПлощадьВсего'=>'','ТорговаяПлощадьЗанято'=>'','ТорговаяПлощадьСвободно',
                'КоличествоТорговыхМестВсего'=>'','КоличествоТорговыхМестЗанято'=>'','КоличествоТорговыхМестСвободно'=>''],
            'arrColumnSort' => [''],
            'arrStyle'=>[
                "header_text" => "Форма №2. Сведения о существующих объектах по состоянию на",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','№ п/п','Наименование объекта','Округ','Уникальный номер адреса (UNOM БТИ)', 'Адрес','Код объекта (СИОПР)','Вид услуг населению (для объектов розничной торговли)', 'Вид размещения (отдельно стоящее, встроенное, пристроенное помещение, занимаемое объектом)','Вид объекта','Единицы измерения (кв.м. торг. пл. / посадочных мест / рабочих мест)',' Проектная емкость объекта в единицах измерения','Общая площадь объекта, кв. м','Территория, кв. м','Год ввода','В составе торгового комплекса','Координаты объекта долгота WGS-84','Координаты объекта широьа WGS-84','Количество работающих']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
                "forPie"=>[
                    'values'=>'gist',
                ]
            ]
        ],
        'пб_АналитическийОтчетОПоступленииТоваров.За период времени'=>[
            'schema'=>'Report_9904_1',
            'arrColumnCalc'=>['Количество'=>['sumItogo','itogo']],
            'arrColumnSort' => ['Товар','Период'],
            'arrStyle'=>[
                "header_text" => "Аналитический отчет о поступлении товаров за период времени",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Товар']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
                "forPie"=>[
                    'values'=>'gist',
                ]
            ]
        ],
        'хс_ПоискСТОБезПризнакаСетевойОбъект'=>[
            'schema'=>'Report_1186_1',
            'arrColumnCalc'=>['Ссылка'=>["data"],'ТорговаяСеть'=>["data","percent"]],
            'arrColumnSort' => ['Округ','Район','Код'],
            'arrStyle'=>[
                "header_text" => "Поиск стационарных предприятий без признака 'Сетевой объект'",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ', 'Район','Код','Наименование','Сетевая компания','Итого']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                "forPie"=>[
                    'values'=>'gist',
                ]
            ]
        ],
        'РегистрацияОбъектаОптовойТорговлиПоАдресуПредприятияОптовойТорговли'=>[
            'schema'=>'Report_1301_1',
            'arrColumnCalc'=>['АдресАдресногоРеестра'=>["data"],'Количество'=>["top","itogo"]],
            'arrColumnSort' => ['Округ','Район','Ссылка'],
            'arrStyle'=>[
                "header_text" => "Регистрация объекта оптовой торговли по адресу предприятия оптовой торговли",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ', 'Район','Предприятие оптовой торговли','Адрес','Количество']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                "forPie"=>[
                    'values'=>'gist',
                ]
            ]
        ],
        'хс_КоличествоСкладскихПредприятийПоОкругамГородаМосквы'=>[
            'schema'=>'Report_1154_1',
            'arrColumnCalc'=>['КоличествоПредприятий'=>['top'],'СредняяЧисленностьРаботников'=>['top'],'КоличествоАрендаторов'=>['top'],'ЧислоРаботниковАрендатора'=>['top'],
                'ХарПомещения'=>['top'],'ПлощадьОбщая'=>['top'],'ПлощадьЗанятая'=>['top'],'ПлощадьАрендуемая'=>['top'],'ПлощадьСобственная'=>['top'],'ПлощадьСвободнаяПоХарактеристикам'=>['top']],
            'arrColumnSort' => ['Округ','Район','Склад'],
            'arrStyle'=>[
                "header_text" => "Количество оптовых предприятий по округам города Москвы",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','','','Кол-во предприятий, шт.','Кол-во сотрудников на предприятии','Кол-во арендаторов,  шт.',
                    'Кол-во сотрудников на предприятии арендаторов','Характеристики помещений',
                    'Общая площадь строений Объекта (кв.м.)','в т.ч. занятая','в т.ч. занято арендаторами',
                    'в т.ч. занято собственными объектами','Площадь характеристик помещений','в т.ч. свободно']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                "forPie"=>[
                    '',
                ],
                //"view" =>'list'
            ]
        ],'кс_ОбщественноеПитание'=>[
            'schema'=>'Report_1067_1',
            'arrColumnCalc'=>['КоличествоПредприятий'=>[],'СредняяЧисленностьРаботников'=>['top'],'КоличествоАрендаторов'=>['top'],'ЧислоРаботниковАрендатора'=>['top'],
                'ХарПомещения'=>[""],'ПлощадьОбщая'=>['top'],'ПлощадьЗанятая'=>['top'],'ПлощадьАрендуемая'=>['top'],'ПлощадьСобственная'=>['top'],'ПлощадьСвободнаяПоХарактеристикам'=>['']],
            'arrColumnSort' => ['Округ','Район','Склад'],
            'arrStyle'=>[
                "header_text" => "Количество оптовых предприятий по округам города Москвы",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','Кол-во предприятий, шт.','Кол-во сотрудников на предприятии','Кол-во арендаторов,  шт.',
                    'Кол-во сотрудников на предприятии арендаторов','Характеристики помещений',
                    'Общая площадь строений Объекта (кв.м.)','в т.ч. занятая','в т.ч. занято арендаторами',
                    'в т.ч. занято собственными объектами','Площадь характеристик помещений','в т.ч. свободно']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                "forPie"=>[
                    '',
                ],
                "view" =>'list'
            ]
        ],
        'пб_ОтчетПоАнализуДокументов'=>[
            'schema'=>'Report_1101_1',
            'arrColumnCalc'=>[
                'Вид'=>["sim"],'Дата'=>["sim"],'Номер'=>["sim"],
                'Товар'=>["sim"],'КаналПоставки'=>["sim"],'КаналРеализации'=>["sim"],
                'РегионПоставки'=>["sim"],'Автор'=>["sim"],'ДатаСоздания'=>["sim"],
                'Количество'=>["top","itogo"],'Цена'=>["top"]
            ],
            'arrColumnSort' => ['Предприятие'],
            'arrStyle'=>[
                "header_text" => "Отчет по анализу документов поступлений и реализаций за период",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','Вид','Дата','Номер','Товар','Источник продукции','Канал реализации','Регион поставки (реализации)','Автор','Дата создания','Количество','Цена за ед.']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
                "forPie"=>[
                    '',
                ]
            ]
        ],
        'кс_ДоговораНаВывозМусораНовый'=>[
            'schema'=>'Report_1056_1',
            'arrColumnCalc'=>[
                'колДоговоров'=>['top','itogo'],'колСТОДействует'=>['top','itogo'],'колСТОНеДействует'=>['top','itogo'],'ОбщаяПлощадь'=>['top','itogo'],'ОбъемЗаконтрактованногоМусора'=>['top','itogo']
            ],
            'arrColumnSort' => ['Округ','Район','СТО','АдресАдресногоРеестра'],
            'arrStyle'=>[
                "header_text" => "Договоры на вывоз мусора",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ','','','Количество предприятий торговли(всего)/Адрес','Наличие договора','Срок действия договора не истёк',
                    'Срок действия договора истёк','Общая площадь','Объем законтрактованного мусора (куб. метров в месяц)']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'D','row'=>0]],
                "forPie"=>[
                    '',
                ],
//                "view" =>'list'
            ]
        ],
        'кс_ДоговораНаВывозМусораНовый.Опт'=>[
            'schema'=>'Report_1056_3',
            'arrColumnCalc'=>[
                'АдресАдресногоРеестра'=>['data'],'колДоговоров'=>['top','itogo'],'колСТОДействует'=>['top','itogo'],'колСТОНеДействует'=>['top','itogo'],'ОбщаяПлощадь'=>['top','itogo'],'ОбъемЗаконтрактованногоМусора'=>['top','itogo']
            ],
            'arrColumnSort' => ['Округ','Район','СТО'],
            'arrStyle'=>[
                "header_text" => "Договоры на вывоз мусора",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ','','','Количество предприятий торговли(всего)/Адрес','Наличие договора','Срок действия договора не истёк',
                    'Срок действия договора истёк','Общая площадь','Объем законтрактованного мусора (куб. метров в месяц)']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'D','row'=>0]],
                "forPie"=>[
                    '',
                ],
//                "view" =>'list'
            ]
        ],

        'кс_ДоговораНаВывозМусораНовый.Детали'=>[
            'schema'=>'Report_1056_2',
            'arrColumnCalc'=>[
                'АдресАдресногоРеестра'=>[],'колДоговоров'=>[],'колСТОДействует'=>[],'колСТОНеДействует'=>[],'ОбщаяПлощадь'=>[],'ОбъемЗаконтрактованногоМусора'=>[]
            ],
            'arrColumnSort' => ['Округ','Район','СТО'],
            'arrStyle'=>[
                "header_text" => "Договоры на вывоз мусора",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => '000000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['Округ','','','Количество предприятий торговли(всего)/Адрес','Наличие договора','Срок действия договора не истёк',
                    'Срок действия договора истёк','Общая площадь','Объем законтрактованного мусора (куб. метров в месяц)']
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]],
                "forPie"=>[
                    '',
                ],
                "view" =>'list'
            ]
        ],
//        'кс_ДоговораНаВывозМусораНовый.Опт'=>[
//            'schema'=>'',
//            'arrColumnCalc'=>['E'=>['line']],
//            'arrColumnSort' => ['D'=>'SORT_DESC','B'=>'SORT_DESC','C'=>'SORT_DESC','F'=>'SORT_DESC'],
//            'arrStyle'=>[
//                "header_text" => "Без названия",
//                "first_col" => [                                                                                        // стилт для первой колонки
//                    'font'=>[
//                        'bold' => true,
//                        'color' => ['rgb' => '000000'],
//                        'size' => 14,
//                        'name' => 'Arial'
//                    ]
//                ],
//            ],
//            "header_line" => [
//                ['Товар']
//            ],
//            'rula'=>[
//                "exc"=>[],
//                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
//                "forPie"=>[
//                    'values'=>'gist',
//                ]
//            ]
//        ],
        'пб_ОтчетПоПоступлению.Основной (по периоду)'=>[
            'schema'=>'Report_1106_1',
            'arrColumnCalc'=>['Количество'=>['top'], 'ЦенаМинимум'=>['min'], 'ЦенаМаксимум'=>['max'], 'ЦенаСредняя'=>['mid']],
            'arrColumnSort' => ['Предприятие','ТоварРодитель','Товар','Страна','Период'],
            'arrStyle'=>[
                "header_text" => "Отчет по поступлению товаров периодами",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','','',"Итого","","",""],
                ["","","","Количество","Минимальная цена","Максимальна цена","Средняя цена"]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]]
            ]
        ],
        'пб_ОтчетПоПоступлению.ОтчетОПоступленииРегионРФПредприятиеТовар'=>[
            'schema'=>'Report_30048_1',
            'arrColumnCalc'=>['Количество'=>['top'], 'ЦенаМинимум'=>['min'], 'ЦенаМаксимум'=>['max'], 'ЦенаСредняя'=>['mid']],
            'arrColumnSort' => ['Регион','Предприятие','Товар'],
            'arrStyle'=>[
                "header_text" => "Отчет по поступлению товаров (Регион РФ-Товар-Предприятие)",
                "first_col" => [                                                                                        // стилт для первой колонки
                    'font'=>[
                        'bold' => true,
                        'color' => ['rgb' => 'ff0000'],
                        'size' => 14,
                        'name' => 'Arial'
                    ]
                ],
            ],
            "header_line" => [
                ['','','',"Итого","","",""],
                ["","","","Количество","Минимальная цена","Максимальна цена","Средняя цена"]
            ],
            'rula'=>[
                "exc"=>[],
                'merge_line'=>[['char'=>'A','row'=>0],['char'=>'C','row'=>0]]
            ]
        ],

//    'РегистрацияОбъектаОптовойТорговлиПоАдресуПредприятияОптовойТорговли'=>[
//'schema'=>'',
//            'arrColumnCalc'=>['E'=>[''],'G'=>['']],
//            'arrColumnSort' => ['B'=>'SORT_ASC','C'=>'SORT_DESC','D'=>'SORT_DESC'],
//            'function' => ['start_prc'=>3],
//            'arrStyle'=>[
//                "zag_style" => [
//                    'font'=>[
//                        'bold' => true,
//                        'color' => ['rgb' => '000000'],
//                        'size' => 14,
//                        'name' => 'Arial'
//                    ],
//                ],
//                "header_style" => [
//                    'font'=>[
//                        'bold' => true,
//                        'color' => ['rgb' => '000000'],
//                        'size' => 10,
//                        'name' => 'Arial'
//                    ],
//                    'fill' => [
//                        'fillType' => Fill::FILL_SOLID,
//                        'startColor' => ['rgb' => 'EEF0F4']
//                    ]
//                ],
//                "header_text" => "Регистрация объекта оптовой торговли по адресу предприятия оптовой торговли",
//                "first_col" => [                                                                                        // стилт для первой колонки
//                    'font'=>[
//                        'bold' => true,
//                        'color' => ['rgb' => 'ff0000'],
//                        'size' => 14,
//                        'name' => 'Arial'
//                    ]
//                ],
//                "row_color"=>[
//                    "start"=>[
//                        'fill' => array(
//                            'fillType' => Fill::FILL_SOLID,
//                            'startColor' => array('argb' => 'FF4F81BD')
//                        )
//                    ],
//                    "stop"=>[
//                        'fill' => array(
//                            'fillType' => Fill::FILL_SOLID,
//                            'startColor' => array('argb' => 'FF4F81BD')
//                        )
//                    ],
//                ]
//            ],
//            "header_line" => [
//                ['','',"Итого"],
//                ["","","Количество","Процент"]
//            ],
//        'rula'=>[
//            "exc"=>[],
//            'merge_line'=>[['char'=>'A','row'=>0],['char'=>'A','row'=>0]],
//            "forPie"=>[
//                'values'=>'gist',
//            ]
//        ]
//        ]
    ];
    /* возвращает настройки отчёта  */
    return $arrN[$N];
}
