<?php
function polygonArea($X, $Y, $n)
{
    // Initialze area
    $area = 0.0;
    // Рассчитать значение
    // формула шнурка
    $j = $n- 1;
    for ($i = 0; $i < $n; $i++)
    {
        $area += ($X[$j] + $X[$i]) * ($Y[$j] - $Y[$i]);
        // j - предыдущая вершина i
        $j = $i;
    }
    // Возвращаем абсолютное значение
    return abs($area / 2.0)*0.695*1000 ;
}
// Код драйвера
$X = [];
$Y = [];
$coordArr = [
    [4185597.715048984, 7493216.632837842], [4186077.038913857, 7493899.788753844], [4185572.236088154, 7494367.965588538], [4185069.82182239, 7493529.745998406], [4185597.715048984, 7493216.632837842]
];
$Pi = 3.14159265358979323846;
$Rd = 6378137;
foreach ($coordArr as $val){
    $X[] = ((float)$val[0]/$Rd)*180/$Pi;
    $Y[] = (atan(exp((float)$val[1]/$Rd))*2-$Pi/2)*180/$Pi;
}
$n = count($X);
echo polygonArea($X, $Y, $n);